export default
`# รากที่เปลี่ยนแปลงไปทำหน้าที่พิเศษ

### รากค้ำจุน (Prop root)

เป็นรากที่แตกออกจากข้อของลำต้นแล้วพุ่งทแยงลงไปในดิน เพื่อช่วยพยุงลำต้นไว้ไม่ให้ล้มง่ายเช่น รากค้ำจุนของข้าวโพด เตย ลำเจียก ยางอินเดีย ไทรย้อย โกงกาง
![Prop root](rootModifiedProp)

### รากเกาะ (Climbing root)

เป็นรากที่มักแตกออกตามข้อของลำต้น แล้วมาเกาะตามหลักหรือเสา เพื่อพยุงลำต้นให้ติดแน่นและชูลำต้นขึ้นที่สูง เช่น รากพลู พลูด่าง พริกไทย กล้วยไม้ และไม้เลื้อยต่างๆ
![Climbing root](rootModifiedClimbing)

### รากสังเคราะห์ด้วยแสง (Photosynthesis root)

เป็นรากที่แตกออกจากข้อของลำต้นหรือกิ่งแล้วห้อยลงมาในอากาศ มีสีเขียวของคลอโรฟิลล์จึงเป็นรากที่ทำหน้าที่สังเคราะห์แสงได้ เช่น รากกล้วยไม้ ไทร โกงกาง
![Photosynthesis root](rootModifiedPhotosynthesis)

### รากหายใจ (Respiration root)

ทำหน้าที่ช่วยหายใจได้มากเป็นพิเศษ รากชนิดนี้จะชูปลายขึ้นมาเหนือดินหรือผิวน้ำ บางทีก็ลอยตามผิวน้ำจึงเรียกอีกชื่อหนึ่งว่ารากทุ่นลอย เช่น ลำพู แสม โกงกาง แพงพวยน้ำ ผักกระเฉด
![Respiration root](rootModifiedRespiration)

### รากกาฝาก (Parasitic root)

เป็นรากของพืชที่เป็นปาราสิต ไปเกาะพืชชนิดอื่นซึ่งเป็น host เพื่อแย่งอาหาร เช่น ต้นกาฝาก ฝอยทอง พืชพวกนี้จะแทงรากเข้าไปใน xylem และ phloem ของ host
![Parasitic root](rootModifiedParasitic)

### รากอากาศ (Aerial Root)

เป็นรากที่อยู่เหนือดิน ห้อยหรือลอยอยู่ในอากาศ หรือเกาะกับสิ่งต่างๆ ในอากาศ ไม่จมลงไปในดิน รากพวกนี้มีหน้าที่ต่างๆ กัน เช่น รากค้ำจุน รากเกาะ รากสังเคราะห์ด้วยแสง และรากหายใจ เป็นต้น
![Aerial root](rootModifiedAerial)

### รากสะสมอาหาร (Food storage root)

เป็นรากที่สะสมอาหารพวกแป้งโปรตีนหรือน้ำตาลไว้ จนรากเปลี่ยนแปลงรูปร่างมีขนาดใหญ่ซึ่งมักจะเรียกกันว่า “หัว” เช่น หัวแครอท หัวผักกาด หรือหัวไชเท้า หัวผักกาดแดงหรือแรดิช (Radish) หัว บีท (Beet root) และหัวมันแกว เป็นรากสะสมอาหารที่เปลี่ยนแปลงมาจากราก แก้ว ส่วนรากสะสมอาหารของมันเทศ รักเร่ กระชาย เปลี่ยนแปลงมาจากรากแขนง
![Food storage root](rootModifiedFoodStorage)
`